{
  "contentjs": [
    {
      "id": "html0",
      "href": "html#html0",
      "title": "HTML-документ та його структура.",
      "article": "<p>HTML-документ - це текстовий документ, який може бути створений в звичайному текстовому редакторі (Блокнот) або в спеціалізованому, з підсвічуванням коду (Notepad ++). HTML-документ має розширення <b>.html</b>. HTML-документ складається з HTML-елементів і тексту. Кожен HTML-елемент утворюється початковим (відкриваючим) і кінцевим (закриваючим) тегом. Існують і одинарні (без закриваючого) теги. Відкриваючий тег показує, де починається елемент, закриваючий - де закінчується. Закриваючий тег утворюється шляхом додавання слеша / перед іменем тега: <br><b>&lt;тег&gt; контент &lt;/тег&gt;</b> Між відкриваючим і закриваючим тегами знаходиться вміст тега - контент.<br><br>Структура HTML-документа:</p><pre><code>&lt;!DOCTYPE HTML&gt;  <i>&lt; !-- Визначає (декларує) тип документа --&gt;</i>\n&lt;html&gt;           <i>&lt; !-- Визначає текст як HTML-код --&gt;</i>\n  &lt;head&gt;   <i>&lt; !-- Заголовок HTML-файлу, призначений для браузера та пошукових систем --&gt;</i>\n           <i>&lt; !-- тут описується службова інформація про сторінку: кодування, назва сторінки, лінки до інших файлів --&gt;</i>\n    &lt;meta charset=&quot;utf-8&quot;&gt;\n    &lt;title&gt; Назва Web-сторінки &lt;/title&gt;    <i>&lt;!-- відображається в рядку заголовка браузера --&gt;</i>\n  &lt;/head&gt;\n\n  &lt;body&gt;\n     <b>Контент Web-сторінки що відобразиться користувачу у вікні браузера</b>\n  &lt;/body&gt;\n\n&lt;/html&gt;</code></pre>"
    },
    {
      "id": "html1",
      "href": "html#html1",
      "title": "Атрибути тегів.",
      "article": "<p>Щоб розширити можливості окремих тегів застосовуються атрибути тегів. Атрибути завжди пишуться всередині відкриваючого тега і після символів самого тега. Після них слідує знак рівності і значення атрибута в подвійних лапках. Можна написати в одному тезі кілька атрибутів в будь-якому порядку.<br><b>&lt;тег атрибут1 = &quot;значення&quot;  &nbsp;атрибут2 = &quot;значення&quot;&gt; текст &lt;/тег&gt;</b></p><br><table class=\"table\"><tr><td colspan=\"2\"><b>Стандартні атрибути</b> <small> (можуть бути використані для будь-якого HTML-елемента)</small></td></tr><tr><td>id</td><td>Визначає унікальний ідентифікатор для елементу</td></tr><tr><td>class</td><td>Визначає ім'я класу для елемента (використовується для визначення класу в таблиці стилів).</td></tr><tr><td>style</td><td>Задає стилі CSS для елемента, у якого вказаний цей атрибут.</td></tr><tr><td>title</td><td>Підказка, яка з'являється при наведенні курсору на елемент</td></tr></table>"
    }




  ]
}
